#+LANGUAGE: en
#+PROPERTY: header-args :tangle yes
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDS: noexport

*** Feed 
    RSS Feeds.
    #+BEGIN_SRC emacs-lisp
    (global-set-key (kbd "C-x w") 'elfeed)
    (setq elfeed-feeds
    '(("https://www.reddit.com/r/emacs/comments.rss" emacs)
    ("https://www.infobae.com/feeds/rss/" infobae)
    ("https://www.r-users.com/feed/?post_type=job_listing" rjobs)
    ("https://www.reddit.com/r/emacs.rss" emacs)))     
    #+END_SRC

    #+RESULTS:
    | https://www.reddit.com/r/emacs/comments.rss         | emacs   |
    | https://www.infobae.com/feeds/rss/                  | infobae |
    | https://www.r-users.com/feed/?post_type=job_listing | rjobs   |
    | https://www.reddit.com/r/emacs.rss                  | emacs   |
    
    #+BEGIN_SRC emacs-lisp
    (use-package eradio
    :defer t
    :config
    (setq eradio-channels '(("def con - soma fm" . "https://somafm.com/defcon256.pls")          ;; electronica with defcon-speaker bumpers
    ("metal - soma fm"   . "https://somafm.com/metal130.pls")           ;; \m/
    ("cyberia - lainon"  . "https://lainon.life/radio/cyberia.ogg.m3u") ;; cyberpunk-esque electronica
    ("cafe - lainon"     . "https://lainon.life/radio/cafe.ogg.m3u"))))  ;; boring ambient, but with lain

    (global-set-key (kbd "C-c r p") 'eradio-play)
    (global-set-key (kbd "C-c r s") 'eradio-stop)

    #+END_SRC

    [[https://github.com/olav35/eradio][Radio]]
